Repository: a-ilin/vidalia
Catalog: pkg/win32/po/*/vidalia_*.po
Languages: az, de

# BundleSetupCaption
source: ${BUNDLE_NAME} setup
az: ${BUNDLE_NAME} quraşdırılması

# BundleWelcomeText
source: This wizard will guide you through the installation of Tor, Vidalia, Privoxy, and Torbutton. Tor is a system for using the Internet anonymously, helping you anonymize Web browsing and publishing, instant messaging, IRC, and more. Vidalia is a GUI that helps you control, monitor, and configure Tor. Privoxy is a filtering web proxy that protects your privacy and helps remove ads, banners, and popups. Torbutton is a Firefox extension that allows you to quickly enable or disable anonymous web browsing. If you have previously installed Tor, Vidalia, Privoxy, or Firefox, please make sure they are not running before continuing this installation. $_CLICK
az: Bu proqram Torun,Vidalia-nın, Privoxy-un və Tordüyməsi-nin yüklənməsi ərəfəsində sizə bələdçilik edəcək. Tor İnternetdən anonim istifadə etmək üçün sistemdir. Sizə anonim veb səyyahları və dərcləri, təcili məsajları, İRC və daha çoxunda istifadəyə kömək edir. Vidalia GUİ olmaqla sizə monitoru və Toru təşkil etməkdə kömək edir. Privoxy sizin gizliliyinizi qoruyan filtrləmə şəbəkəsi sələhiyyətinə malikdir və elanları, bannerləri və popups-u silməyə kömək edir. Tordüyməsi Firefox əlavəsidir.o imkan verirki siz qadağa qoyulmuş veb səyyahlara daxil ola biləsiniz. Əgər siz əvvəlcədən quraşdırmışsınızsa Tor, Vidalia, Privoxy və ya Firefox quraşdırmışsınızsa lütfən bu yükləmələri etməzdən əvvəl onların davam etmədiyinə əmin olun. $_CLICK

# BundleWelcomeTitle
source: Welcome to the ${BUNDLE_NAME} Setup Wizard
az: Proqram yükləmələrinə xoş gəldiniz ${BUNDLE_NAME}
de: Willkommen beim ${BUNDLE_NAME} Installations-Assistent

# BundleLinkText
source: ${TOR_NAME} installation documentation
az: Quraşdırma sənədləşməsi ${TOR_NAME}
de: ${TOR_NAME} Installations-Dokumentation

# BundleFinishText
source: Installation is complete. Please see https://www.torproject.org/docs/tor-doc-windows to learn how to configure your applications to use Tor. If you installed Torbutton, you will need to restart Firefox.
az: Yüklənmə tamamlandı. Zəhmət olmasa Tordan istifadə etmək üçün ərizələrinizi necə hazırlamağı burdan öyrənin https://www.torproject.org/docs/tor-doc-windows Əgər siz Tor düyməsin yükləmisinizsə onda siz Firefox-a yenidən başlamağa ehtiyac duyacaqsınız.
de: Die Installation ist abgeschlossen. Bitte besuchen Sie https://www.torproject.org/docs/tor-doc-windows um zu erfahren, wie Sie Ihre Anwendungen zur Benutzung mit Tor einrichten können. Sollten Sie Torbutton installiert haben, müssen Sie Firefox neu starten.

# BundleRunNow
source: Run installed components now
az: Yükləməniindi başla
de: Installierte Anwendungen jetzt starten

# VidaliaGroupDesc
source: Vidalia is a GUI that helps you control, monitor, and configure Tor.
az: Vidalia GUİ olmaqla sizə monitoru və Toru təşkil etməkdə kömək edir.
de: Vidalia ist eine Oberfläche zur Einrichtung, Steuerung und Überwachung von Tor.

# VidaliaUninstDesc
source: Remove ${VIDALIA_DESC}.
az: Sil ${VIDALIA_DESC}.
de: Entferne ${VIDALIA_DESC}.

# VidaliaSetupCaption
source: ${VIDALIA_NAME} setup
az: ${VIDALIA_NAME} qurğu

# VidaliaWelcomeText
source: This wizard will guide you through the installation of Vidalia, a GUI that helps you control, monitor, and configure Tor. $_CLICK
az: Bu proqram GUİ nin qurmalarından olan Vidali yükləmələrində sizə bələdçilik edəcək və sizin idarə etmənizə, monitorunuza və Torun təşkilinə kömək edəcəkdir. $_CLICK
de: Dieser Assistent führt Sie durch die Installation von ${VIDALIA_DESC}. $_CLICK

# VidaliaWelcomeTitle
source: Welcome to the ${VIDALIA_NAME} Setup Wizard
az: $ {VIDALIA_NAME} Proqram yükləmələrinə xoş gəldiniz
de: Willkommen beim ${VIDALIA_NAME} Installations-Assistent

# VidaliaLinkText
source: ${VIDALIA_NAME} homepage
az: ${VIDALIA_NAME} əsas səhifə
de: ${VIDALIA_NAME} Webseite

# VidaliaAppDesc
source: Vidalia is a GUI that helps you control, monitor, and configure Tor.
az: Vidalia GUİ olmaqlaq sizə monitoru və Toru təşkil etməkdə kömək edir.
de: Vidalia ist eine Oberfläche zur Einrichtung, Steuerung und Überwachung von Tor.

# VidaliaStartup
source: Run At Startup
az: İşə salarkəndə davam etsin
de: Beim Systemstart ausführen

# VidaliaStartupDesc
source: Automatically run ${VIDALIA_NAME} at startup.
az: İşə salanda ${VIDALIA_NAME} avtomatik davam etsin.
de: ${VIDALIA_NAME} beim Systemstart automatisch ausführen.

# VidaliaShortcuts
source: Add to Start Menu
az: Başlamaq menyusunu əlavə et
de: Zum Startmenü hinzufügen

# VidaliaShortcutsDesc
source: Add ${VIDALIA_NAME} to your Start menu.
az: Başlamaq menyunuza ${VIDALIA_NAME} əlavə edin.
de: ${VIDALIA_NAME} zu Ihrem Startmenü hinzufügen.

# VidaliaRunNow
source: Run ${VIDALIA_NAME}
az: ${VIDALIA_NAME} Davam edir
de: ${VIDALIA_NAME} jetzt starten

# TorGroupDesc
source: Tor is a system for using the Internet anonymously, helping you anonymize Web browsing and publishing, instant messaging, IRC, and more.
az: Tor İnternetdən anonim istifadə etmək üçün sistemdir. Sizə anonim veb səyyahları və dərcləri, təcili məsajları, İRC və daha çoxunda istifadəyə kömək edir.
de: Tor ist ein System, um das Internet anonym zu nutzen. Es anonymisiert das Webbrowsen, das Veröffentlichen von Inhalten, Instant Messaging, IRC, usw.

# TorUninstDesc
source: Remove ${TOR_DESC}.
az: ${TOR_DESC} sil.
de: Entferne ${TOR_DESC}.

# TorAppDesc
source: Install ${TOR_DESC}.
az: ${TOR_DESC} quraşdır.
de: Installiere ${TOR_DESC}.

# TorAskOverwriteTorrc
source: You already have a Tor configuration file.$ $ Do you want to overwrite it with the default sample configuration file?
az: Siz Tor konfiqurasiyası faylına artıq maliksiniz.$ $ Siz tipik konfiqurasiya faylı ilə bunun üstünə yazmaq istəyirsiniz?
de: Sie haben bereits eine Tor Konfigurationsdatei.$ $ Soll diese mit der allgemeinen Beispiel-Konfigurationsdatei überschrieben werden?

# TorDocumentation
source: Documentation
az: Sənədləşmə
de: Dokumentation

# TorDocumentationDesc
source: Install ${TOR_NAME} documentation.
az: Sənədləşməni ${TOR_NAME} quraşdır.
de: Installiere ${TOR_NAME} Dokumentation.

# TorShortcuts
source: Add to Start Menu
az: Başlamaq menyusunu əlavə et
de: Zum Startmenü hinzufügen

# TorShortcutsDesc
source: Add ${TOR_NAME} to your Start menu.
az: Başlamaq menyunuza ${TOR_NAME} əlavə et.
de: ${TOR_NAME} zu Ihrem Startmenü hinzufügen.

# PrivoxyGroupDesc
source: Privoxy is a filtering web proxy that protects your privacy and helps remove ads, banners, and popups.
az: Privoxy sizin gizliliyinizi qoruyan filtrləmə şəbəkəsi sələhiyyətinə malikdir və elanları, bannerləri və popups-u silməyə kömək edir.

# PrivoxyUninstDesc
source: Remove ${PRIVOXY_DESC}.
az: ${PRIVOXY_DESC} sil.

# PrivoxyAppDesc
source: Install ${PRIVOXY_DESC}.
az: ${PRIVOXY_DESC} quraşdır.

# PrivoxyShortcuts
source: Add to Start Menu
az: Başlamaq menyusunu əlavə et

# PrivoxyShortcutsDesc
source: Add ${PRIVOXY_NAME} to your Start menu.
az: Başlamaq menyunuza ${PRIVOXY_NAME} əlavə et.

# PrivoxyStartup
source: Run At Startup
az: İşə salarkən davam etsin

# PrivoxyStartupDesc
source: Automatically run ${PRIVOXY_NAME} at startup.
az: İşə salarkən ${PRIVOXY_NAME} avtomatik davam etsin.

# TorbuttonGroupDesc
source: Torbutton is a Firefox extension that allows you to quickly enable or disable anonymous web browsing.
az: Tordüyməsi Firefox əlavəsidir.o imkan verirki siz qadağa qoyulmuş veb səyyahlara daxil ola biləsiniz.
de: Torbutton ist eine Erweiterung für Firefox, die das schnelle Ein- und Ausschalten des anonymen Webbrowsens ermöglicht.

# TorbuttonUninstDesc
source: Remove ${TORBUTTON_DESC}.
az: ${TORBUTTON_DESC} sil.
de: Entferne ${TORBUTTON_DESC}.

# TorbuttonAppDesc
source: Install ${TORBUTTON_DESC}.
az: ${TORBUTTON_DESC} quraşdır.
de: Installiere ${TORBUTTON_DESC}.

# TorbuttonAddToFirefox
source: Add to Firefox
az: Firefox əlavə et.
de: Zu Firefox hinzufügen

# TorbuttonAddToFirefoxDesc
source: Add the ${TORBUTTON_DESC} extension to Firefox.
az: Firefox-a ${TORBUTTON_DESC} əlavəsini daxil edin.
de: Die ${TORBUTTON_DESC}-Erweiterung zu Firefox hinzufügen.

# TorbuttonFirefoxNotFound
source: Firefox was not found on your system. Not installing Torbutton.
az: Firefox sizin sisteminizdə tapılmadı. Tordüyməsi yüklənmir.
de: Firefox konnte nicht gefunden werden. Torbutton wird nicht installiert.

# AppData
source: Application Data
az: Tətbiqi Məlumat
de: Anwendungsdaten

# AppDataUninstDesc
source: Remove saved application data and configuration files.
az: Saxlanılan tətbiqi məlumatı və konfiqurasiya fayllarını silin.
de: Entferne gespeicherte Anwendungsdaten und Konfigurationsdateien.

# FirefoxWarningPageTitle
source: Firefox is not installed
az: Firefox yüklənmədi.
de: Firefox ist nicht installiert

# FirefoxWarningPageSubtitle
source: We recommend that you install Firefox before continuing, for best safety.
az: Biz məsləhət görürük ki, ən yaxşı təhlükəsizlik üçün davam etməmişdən əvvəl Firefox-u yükləyəsiniz.
de: Für die maximale Sicherheit empfehlen wir, Firefox zu installieren, bevor Sie fortfahren.

# FirefoxWarningPageUpperText
source: The Mozilla Firefox Web browser is not installed on your computer. Tor will work with other browsers, such as Internet Explorer, but is easier to use with Firefox, which also does a better job of protecting your anonymity. If you would like to install Firefox, please press Cancel, then go to the Firefox download page at
az: Mozilla Firefox Veb səyyahı sizin kompüterinizdə quraşdırılmayıb. Tor başqa səyyahlarla işləyəcək, Internet Explorer kimi, amma sizin anonimliyinizin qorumağın daha asan yolu Firefox-dan istifadə etməkdir. Əgər siz Firefox-u quraşdırmaq istəyirsinizsə, zəhmət olmasa Ləğv etə vur sonra Firefox u yüklyəcəyiniz pəncərəyə gedin
de: Der Mozilla Firefox-Browser ist auf Ihrem Computer nicht installiert. Tor arbeitet mit anderen Browsers, wie dem Internet Explorer zusammen, aber ist einfacher mit Firefox zu nutzen, der zudem besser Ihre Anonymität schützt. Wenn Sie Firefox installieren wollen, klicken Sie bitte auf Abbrechen und besuchen Sie anschliessend die Firefox Downloadseite unter

# FirefoxWarningPageLowerText
source: When you are done installing Firefox, you can once again run the Tor installer. Or, if you would prefer to install Tor without Firefox, simply press Next to continue.
az: Firefoxu yüklədikdə siz bir dəfədə yenidən Tor qurgusunu davam etdirə bilərsiniz. Və ya əgər siz Firefox-suz Tor quraşdırmağı üstün tutardınızsa, sadəcəSonrakı -nı klikləyərək davam edə bilərsiniz.
de: Wenn Sie Firefox installiert haben, können Sie das Tor Installationsprogramm erneut ausführen. Falls Sie es vorziehen, Tor ohne Firefox zu installieren, klicken Sie einfach auf Weiter,

# BundleWelcomeText
source: This wizard will guide you through the installation of Tor, Vidalia, Polipo, and Torbutton. Tor is a system for using the Internet anonymously, helping you anonymize Web browsing and publishing, instant messaging, IRC, and more. Vidalia is a GUI that helps you control, monitor, and configure Tor. Polipo is a caching web proxy that helps increase performance of browsing the web through Tor. Torbutton is a Firefox extension that allows you to quickly enable or disable anonymous web browsing. If you have previously installed Tor, Vidalia, Polipo, or Firefox, please make sure they are not running before continuing this installation. $_CLICK
de: Dieser Assistent wird Sie durch die Installation von Tor, Vidalia, Polipo und Torbutton begleiten. Tor ist ein System, um das Internet anonym zu nutzen. Es anonymisiert das Browsen, das Veröffentlichen von Inhalten, Instant Messaging, IRC, usw. Vidalia ist eine Oberfläche zur Einrichtung, Steuerung und Überwachung von Tor. Polipo ist ein filternder Webproxy, welcher die Leistung des Webbrowsens mittels Tor erhöht. Torbutton ist eine Erweiterung für Firefox, die das schnelle Ein- und Ausschalten des anonymes Webbrowsens ermöglicht. Sollten Sie Tor, Vidalia, Polipo oder Firefox bereits früher installiert haben, stellen Sie sicher, dass diese Programme nicht laufen, bevor Sie die Installation fortsetzen. $_CLICK

# PolipoGroupDesc
source: Polipo is a caching web proxy that increases performance of web browsing through Tor.
de: Polipo ist ein speichernder Web-Proxy, der die Leistung des Webbrowsens durch Tor erhöht.

# PolipoUninstDesc
source: Remove ${POLIPO_DESC}.
de: Entferne ${POLIPO_DESC}.

# PolipoAppDesc
source: Install ${POLIPO_DESC}.
de: Installiere ${POLIPO_DESC}.

# PolipoShortcuts
source: Add to Start Menu
de: Zum Startmenü hinzufügen

# PolipoShortcutsDesc
source: Add ${POLIPO_NAME} to your Start menu.
de: ${POLIPO_NAME} zu Ihrem Startmenü hinzufügen.

# PolipoStartup
source: Run At Startup
de: Beim Systemstart ausführen

# PolipoStartupDesc
source: Automatically run ${POLIPO_NAME} at startup.
de: ${POLIPO_NAME} beim Systemstart automatisch ausführen.

# LanguageCode
source: en
de: de
